BAS BMEKZU Project/src/ChartsOfCalculationTypes/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Удержания</name>
  <comment>(Регл)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.Начисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.Удержания</baseCalculationTypes>
  <attributes>
    <name>КатегорияУдержания</name>
    <type>
      <types>EnumRef.КатегорииУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередностьРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияДляТиповыхОтчетов</name>
    <type>
      <types>EnumRef.ВидыУдержанийДляТиповыхОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВзаиморасчетов</name>
    <type>
      <types>EnumRef.УдалитьВидыВзаиморасчетовСРаботниками</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬСпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬЭтоАлименты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬКатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УДАЛИТЬБазовыеВидыРасч</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCalculationTypes>

BAS BMEKZU Project/src/Enums/КатегорииУдержаний/КатегорииУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииУдержаний</name>
  <enumValues>
    <name>Алименты</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛист</name>
  </enumValues>
  <enumValues>
    <name>ПочтовыйСбор</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/ChartsOfCalculationTypes/Удержания/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Возврат;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) И Не ДополнительныеСвойства.Свойство("ИзменениеПланаВидовРасчетаПоНастройкам") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОчередностьРасчета();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьОчередностьРасчета()
	
	ОчередностьРасчета = 0;
	// Вознаграждение платежного агента рассчитывается после исполнительных листов
	Если КатегорияУдержания = Перечисления.КатегорииУдержаний.ПочтовыйСбор Тогда
		ОчередностьРасчета = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
